---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewName
source: html/33469013-6638-1417-57ea-55e990ca5d6e.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewName Property

"View Name"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewName { get; }
```